Documents/ПоступлениеТоваровИМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровИМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыИМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеТоваровИМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыИМатериалы.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыИМатериалы.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыИМатериалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Товар) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПоставщика(СтрокаТЧ.Товар, Объект.ДатаВходящегоДокумента, Объект.Поставщик)[0];
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	РаботаСТабличнымичастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ТЧ = Объект.ТоварыИМатериалы;
	МассивНоменклатуры = Новый Массив;
	Если ЗначениеЗаполнено(ТЧ) Тогда 
		Для каждого СтрокаТЧ Из ТЧ Цикл			
			МассивНоменклатуры.Добавить(СтрокаТЧ.Товар);
		КонецЦикла;
		МассивЦен = РаботаСЦенами.ПолучитьЦенуПоставщика(МассивНоменклатуры, Объект.ДатаВходящегоДокумента, Объект.Поставщик);
		инд = 0;
		Для каждого СтрокаТЧ Из ТЧ Цикл
			Если МассивЦен[инд] = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("В базе данных не найдены цены для  номенклатуры %1",СтрокаТЧ.Товар);
				Сообщение.Сообщить(); 
				инд = инд + 1; 		
				Продолжить;
			Иначе
				СтрокаТЧ.Цена = МассивЦен[инд]; 
				РаботаСТабличнымичастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
				инд = инд + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
    Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
 
КонецПроцедуры
